#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ListTasksLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=list-tasks-lambda-java-exec-role]
module.ListTaskListsLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=list-taskLists-lambda-java-exec-role]
module.GetTaskListByIdLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=get-taskList-by-id-lambda-java-exec-role]
module.CreateTaskLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=create-task-lambda-java-exec-role]
aws_sqs_queue.report_dlq: Refreshing state... [id=https://sqs.sa-east-1.amazonaws.com/514015205591/report-generation-dlq]
module.DeleteTaskListLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=delete-taskList-lambda-java-exec-role]
module.todo_table.aws_dynamodb_table.this: Refreshing state... [id=Tasks]
aws_ses_email_identity.sender_email: Refreshing state... [id=limafilipe.coding@gmail.com]
module.CreateTaskListLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=create-taskList-lambda-java-exec-role]
module.GetTaskByIdLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=get-task-by-id-lambda-java-exec-role]
aws_api_gateway_rest_api.task_api: Refreshing state... [id=80h66mrcbi]
module.UpdateTaskLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=update-task-lambda-java-exec-role]
aws_cognito_user_pool.user_pool: Refreshing state... [id=sa-east-1_oBS6D494g]
aws_s3_bucket.csv_bucket: Refreshing state... [id=todo-lambda-csv-reports-filipe]
module.DeleteTaskLambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=delete-task-lambda-java-exec-role]
module.ListTaskListsLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=list-taskLists-lambda-java-exec-role-20251024051455208300000002]
module.ListTasksLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=list-tasks-lambda-java-exec-role-20251011070437875600000001]
module.DeleteTaskListLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=delete-taskList-lambda-java-exec-role-20251024051455457900000005]
module.CreateTaskListLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=create-taskList-lambda-java-exec-role-20251024051455205100000001]
module.GetTaskListByIdLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=get-taskList-by-id-lambda-java-exec-role-20251024051455326900000004]
module.GetTaskByIdLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=get-task-by-id-lambda-java-exec-role-20251012205953506300000002]
module.CreateTaskLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=create-task-lambda-java-exec-role-20251011065404034500000004]
module.UpdateTaskLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=update-task-lambda-java-exec-role-20251011070437882400000002]
module.DeleteTaskLambda.aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=delete-task-lambda-java-exec-role-20251011070437894100000003]
aws_sqs_queue.report_queue: Refreshing state... [id=https://sqs.sa-east-1.amazonaws.com/514015205591/report-generation-queue]
aws_api_gateway_resource.lists_resource: Refreshing state... [id=2ioehs]
aws_api_gateway_resource.list_id_resource: Refreshing state... [id=0rmao8]
aws_iam_policy.sqs_send_policy: Refreshing state... [id=arn:aws:iam::514015205591:policy/lambda-sqs-send-policy]
aws_api_gateway_authorizer.cognito_authorizer: Refreshing state... [id=st6sey]
aws_cognito_user_pool_client.app_client: Refreshing state... [id=4bvppquj2d6n346jskc8tie02b]
aws_api_gateway_resource.list_tasks_resource: Refreshing state... [id=omgifz]
aws_iam_policy.lambda_dynamodb_write_policy: Refreshing state... [id=arn:aws:iam::514015205591:policy/lambda-dynamodb-tasks-write-policy]
aws_iam_policy.lambda_dynamodb_read_policy: Refreshing state... [id=arn:aws:iam::514015205591:policy/lambda-list-tasks-dynamodb-policy]
module.DeleteTaskLambda.aws_lambda_function.this: Refreshing state... [id=delete-task-lambda-java]
module.DeleteTaskListLambda.aws_lambda_function.this: Refreshing state... [id=delete-taskList-lambda-java]
module.GetTaskByIdLambda.aws_lambda_function.this: Refreshing state... [id=get-task-by-id-lambda-java]
module.GetTaskListByIdLambda.aws_lambda_function.this: Refreshing state... [id=get-taskList-by-id-lambda-java]
module.ListTaskListsLambda.aws_lambda_function.this: Refreshing state... [id=list-taskLists-lambda-java]
module.UpdateTaskLambda.aws_lambda_function.this: Refreshing state... [id=update-task-lambda-java]
module.CreateTaskLambda.aws_lambda_function.this: Refreshing state... [id=create-task-lambda-java]
module.CreateTaskListLambda.aws_lambda_function.this: Refreshing state... [id=create-taskList-lambda-java]
module.ListTasksLambda.aws_lambda_function.this: Refreshing state... [id=list-tasks-lambda-java]
aws_api_gateway_method.post_list_task_method: Refreshing state... [id=agm-80h66mrcbi-2ioehs-POST]
aws_api_gateway_method.delete_list_task_method: Refreshing state... [id=agm-80h66mrcbi-0rmao8-DELETE]
aws_api_gateway_method.get_list_task_by_id_method: Refreshing state... [id=agm-80h66mrcbi-0rmao8-GET]
aws_api_gateway_method.get_list_tasks_method: Refreshing state... [id=agm-80h66mrcbi-2ioehs-GET]
aws_iam_role_policy_attachment.get_by_id_lambda_dynamodb_read_access: Refreshing state... [id=get-task-by-id-lambda-java-exec-role-20251012205953423600000001]
aws_iam_role_policy_attachment.get_list_by_id_lambda_dynamodb_read_access: Refreshing state... [id=get-taskList-by-id-lambda-java-exec-role-20251024051455574200000008]
aws_iam_role_policy_attachment.list_lambda_dynamodb_read_access: Refreshing state... [id=list-tasks-lambda-java-exec-role-20250926231550464600000001]
aws_iam_role_policy_attachment.list_taskList_lambda_dynamodb_read_access: Refreshing state... [id=list-taskLists-lambda-java-exec-role-20251024051455233800000003]
aws_iam_role_policy_attachment.delete_list_lambda_dynamo_acess: Refreshing state... [id=delete-taskList-lambda-java-exec-role-20251024051455570800000007]
aws_iam_role_policy_attachment.delete_lambda_dynamo_acess: Refreshing state... [id=delete-task-lambda-java-exec-role-20251001042803932300000001]
aws_iam_role_policy_attachment.update_lambda_dynamo_acess: Refreshing state... [id=update-task-lambda-java-exec-role-20251001040959893300000001]
aws_iam_role_policy_attachment.create_lambda_dynamodb_access: Refreshing state... [id=create-task-lambda-java-exec-role-20250926231550526700000002]
aws_iam_role_policy_attachment.create_list_lambda_dynamodb_access: Refreshing state... [id=create-taskList-lambda-java-exec-role-20251024051455537300000006]
aws_api_gateway_resource.list_task_id_resource: Refreshing state... [id=i7kylc]
aws_api_gateway_method.get_tasks_method: Refreshing state... [id=agm-80h66mrcbi-omgifz-GET]
aws_api_gateway_method.post_task_method: Refreshing state... [id=agm-80h66mrcbi-omgifz-POST]
aws_lambda_permission.allow_api_gateway_create_list: Refreshing state... [id=AllowAPIGatewayInvokeCreateList]
aws_api_gateway_integration.post_list_task_integration: Refreshing state... [id=agi-80h66mrcbi-2ioehs-POST]
aws_lambda_permission.allow_api_gateway_delete_list: Refreshing state... [id=AllowAPIGatewayInvokeDeleteList]
aws_api_gateway_integration.delete_list_task_integration: Refreshing state... [id=agi-80h66mrcbi-0rmao8-DELETE]
aws_api_gateway_integration.get_list_tasks_integration: Refreshing state... [id=agi-80h66mrcbi-2ioehs-GET]
aws_lambda_permission.allow_api_gateway_list_taskLists: Refreshing state... [id=AllowAPIGatewayInvokeListTaskLists]
aws_api_gateway_integration.get_list_task_by_id_integration: Refreshing state... [id=agi-80h66mrcbi-0rmao8-GET]
aws_lambda_permission.allow_api_gateway_get_list_by_id: Refreshing state... [id=AllowAPIGatewayInvokeGetListById]
aws_api_gateway_method.update_task_method: Refreshing state... [id=agm-80h66mrcbi-i7kylc-PUT]
aws_api_gateway_method.get_tasks_by_id_method: Refreshing state... [id=agm-80h66mrcbi-i7kylc-GET]
aws_api_gateway_method.delete_task_method: Refreshing state... [id=agm-80h66mrcbi-i7kylc-DELETE]
aws_lambda_permission.allow_api_gateway_list: Refreshing state... [id=AllowAPIGatewayInvokeList]
aws_api_gateway_integration.get_task_integration: Refreshing state... [id=agi-80h66mrcbi-omgifz-GET]
aws_api_gateway_integration.post_task_integration: Refreshing state... [id=agi-80h66mrcbi-omgifz-POST]
aws_lambda_permission.allow_api_gateway_create: Refreshing state... [id=AllowAPIGatewayInvokeCreate]
aws_lambda_permission.allow_api_gateway_update: Refreshing state... [id=AllowAPIGatewayInvokeUpdate]
aws_api_gateway_integration.update_task_integration: Refreshing state... [id=agi-80h66mrcbi-i7kylc-PUT]
aws_lambda_permission.allow_api_gateway_get_by_id: Refreshing state... [id=AllowAPIGatewayInvokeGetById]
aws_api_gateway_integration.get_task_by_id_integration: Refreshing state... [id=agi-80h66mrcbi-i7kylc-GET]
aws_lambda_permission.allow_api_gateway_delete: Refreshing state... [id=AllowAPIGatewayInvokeDelete]
aws_api_gateway_integration.delete_task_integration: Refreshing state... [id=agi-80h66mrcbi-i7kylc-DELETE]
aws_api_gateway_deployment.api_deployment: Refreshing state... [id=12a8fa]
aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-80h66mrcbi-v2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_deployment" {
      ~ created_date  = "2025-10-25T02:50:11Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:sa-east-1:514015205591:80h66mrcbi/" -> (known after apply)
      ~ id            = "12a8fa" -> (known after apply)
      ~ invoke_url    = "https://80h66mrcbi.execute-api.sa-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "569150d67c77bdc4bebe918e2ee69d63e722a017"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.post_report_integration will be created
  + resource "aws_api_gateway_integration" "post_report_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "80h66mrcbi"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.post_report_method will be created
  + resource "aws_api_gateway_method" "post_report_method" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "st6sey"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "80h66mrcbi"
    }

  # aws_api_gateway_resource.reports_resource will be created
  + resource "aws_api_gateway_resource" "reports_resource" {
      + id          = (known after apply)
      + parent_id   = "mzm1nyw7q9"
      + path        = (known after apply)
      + path_part   = "reports"
      + rest_api_id = "80h66mrcbi"
    }

  # aws_api_gateway_rest_api.task_api will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "task_api" {
      ~ description                  = "API para Tasks e TaskLists - Atualizado em 2025-10-30T21:59:28Z" -> (known after apply)
        id                           = "80h66mrcbi"
        name                         = "APITASKS"
        tags                         = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "12a8fa" -> (known after apply)
        id                    = "ags-80h66mrcbi-v2"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cognito_user_pool_client.app_client will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "app_client" {
      - client_secret                                 = (sensitive value)
      - default_redirect_uri                          = "" -> null
        id                                            = "4bvppquj2d6n346jskc8tie02b"
        name                                          = "tasks-app-client"
      - prevent_user_existence_errors                 = "" -> null
        # (16 unchanged attributes hidden)
    }

  # aws_iam_policy.report_worker_policy will be created
  + resource "aws_iam_policy" "report_worker_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lambda-report-worker-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:DeleteMessage",
                          + "sqs:GetQueueAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:sa-east-1:514015205591:report-generation-queue"
                    },
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::todo-lambda-csv-reports-filipe/*"
                    },
                  + {
                      + Action   = "ses:SendEmail"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.sqs_send_policy will be updated in-place
  ~ resource "aws_iam_policy" "sqs_send_policy" {
        id               = "arn:aws:iam::514015205591:policy/lambda-sqs-send-policy"
        name             = "lambda-sqs-send-policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:sqs:sa-east-1:514015205591:report-generation-dlq" -> "arn:aws:sqs:sa-east-1:514015205591:report-generation-queue"
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.process_report_lambda_dynamo_access will be created
  + resource "aws_iam_role_policy_attachment" "process_report_lambda_dynamo_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::514015205591:policy/lambda-list-tasks-dynamodb-policy"
      + role       = "process-report-lambda-java-exec-role"
    }

  # aws_iam_role_policy_attachment.process_report_lambda_worker_access will be created
  + resource "aws_iam_role_policy_attachment" "process_report_lambda_worker_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "process-report-lambda-java-exec-role"
    }

  # aws_iam_role_policy_attachment.start_report_lambda_sqs_acess will be created
  + resource "aws_iam_role_policy_attachment" "start_report_lambda_sqs_acess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::514015205591:policy/lambda-sqs-send-policy"
      + role       = "start-report-lambda-java-exec-role"
    }

  # aws_lambda_event_source_mapping.report_queue_trigger will be created
  + resource "aws_lambda_event_source_mapping" "report_queue_trigger" {
      + arn                           = (known after apply)
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:sa-east-1:514015205591:report-generation-queue"
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config {
          + consumer_group_id = (known after apply)
        }

      + self_managed_kafka_event_source_config {
          + consumer_group_id = (known after apply)
        }
    }

  # aws_lambda_permission.allow_api_gateway_start_report will be created
  + resource "aws_lambda_permission" "allow_api_gateway_start_report" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "start-report-lambda-java"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvokeStartReport"
      + statement_id_prefix = (known after apply)
    }

  # module.CreateTaskLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "create-task-lambda-java"
      ~ last_modified                  = "2025-10-30T21:43:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.CreateTaskListLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "create-taskList-lambda-java"
      ~ last_modified                  = "2025-10-30T21:42:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.DeleteTaskLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "delete-task-lambda-java"
      ~ last_modified                  = "2025-10-30T21:42:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.DeleteTaskListLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "delete-taskList-lambda-java"
      ~ last_modified                  = "2025-10-30T21:42:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.GetTaskByIdLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "get-task-by-id-lambda-java"
      ~ last_modified                  = "2025-10-30T21:43:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.GetTaskListByIdLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "get-taskList-by-id-lambda-java"
      ~ last_modified                  = "2025-10-30T21:43:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.ListTaskListsLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "list-taskLists-lambda-java"
      ~ last_modified                  = "2025-10-30T21:43:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.ListTasksLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "list-tasks-lambda-java"
      ~ last_modified                  = "2025-10-30T21:42:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.ProcessReportLambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "process-report-lambda-java-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Project" = "TODOLambdaJava"
        }
      + tags_all              = {
          + "Project" = "TODOLambdaJava"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ProcessReportLambda.aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "process-report-lambda-java-exec-role"
    }

  # module.ProcessReportLambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./target/TODOLambdaJava-1.0-SNAPSHOT.jar"
      + function_name                  = "process-report-lambda-java"
      + handler                        = "dev.filipe.TODOLambda.controller.queue.ProcessReportHandler::handleRequest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "java21"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Project" = "TODOLambdaJava"
        }
      + tags_all                       = {
          + "Project" = "TODOLambdaJava"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CSV_BUCKET_NAME" = "todo-lambda-csv-reports-filipe"
              + "SENDER_NAME"     = "limafilipe.coding@gmail.com"
              + "TASKS_TABLE"     = "Tasks"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + logging_config {
          + application_log_level = (known after apply)
          + log_format            = (known after apply)
          + log_group             = (known after apply)
          + system_log_level      = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.StartReportLambda.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "start-report-lambda-java-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Project" = "TODOLambdaJava"
        }
      + tags_all              = {
          + "Project" = "TODOLambdaJava"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.StartReportLambda.aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "start-report-lambda-java-exec-role"
    }

  # module.StartReportLambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./target/TODOLambdaJava-1.0-SNAPSHOT.jar"
      + function_name                  = "start-report-lambda-java"
      + handler                        = "dev.filipe.TODOLambdaJava.controller.queue.StartReportHandler::handleRequest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "java21"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Project" = "TODOLambdaJava"
        }
      + tags_all                       = {
          + "Project" = "TODOLambdaJava"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "QUEUE_URL"   = "https://sqs.sa-east-1.amazonaws.com/514015205591/report-generation-queue"
              + "TASKS_TABLE" = "Tasks"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + logging_config {
          + application_log_level = (known after apply)
          + log_format            = (known after apply)
          + log_group             = (known after apply)
          + system_log_level      = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.UpdateTaskLambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "update-task-lambda-java"
      ~ last_modified                  = "2025-10-30T21:42:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "hqobT55hwfzHxIxB5vxv0SALObHTOU1s7emScWgdeHU=" -> "da7v8csxRCfrRxT2DUKWVA+yM2rUJ1UP1XtMPglyDSU="
        tags                           = {
            "ManagedBy" = "Terraform"
            "Project"   = "TODOLambdaJava"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Plan: 16 to add, 13 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @slimafilipe, Action: `pull_request`, Working Directory: ``, Workflow: `Lambda Java CI - Build, test & terraform plan`*